app/controllers/charges_controller.rb

  def index
    @charges = Charge.select("charges.*, users.initials AS user_initials,
        customers.name AS customer_name, drivers.number AS driver_number").
      joins(:customer, :driver, :user).
      search(params[:q]).
      customer_id(params[:customer_id]).
      between(params[:field], from, to).
      order("#{sort_column} #{sort_direction}").
      paginate(:page => params[:page], :per_page => per_page)
---
SELECT COUNT(*) FROM `charges` INNER JOIN `customers` ON `customers`.`id` = `charges`.`customer_id` INNER JOIN `drivers` ON `drivers`.`id` = `charges`.`driver_id` INNER JOIN `users` ON `users`.`id` = `charges`.`user_id` WHERE (charges.written_on BETWEEN DATE('2020-10-18 04:26:54') AND DATE('2020-11-18 05:26:54'))

  def report
    t = 'charges/reports/summary'
    @total = { :trips => 0, :price => 0.0, :gst => 0.0, :total => 0.0 }

    if params[:detailed]
      t = 'charges/reports/detailed'
      @charges = Charge.select("charges.*, customers.name AS customer_name").
        joins(:customer, :user).
        search(params[:q]).
        customer_id(params[:customer_id]).
        between(params[:field], from, to).
        order('customer_name, charges.written_on')
---
SELECT customers.name AS customer_name, charges.*, COUNT(written_on) AS trip_count, SUM(price) AS price, SUM(total) AS total FROM `charges` INNER JOIN `customers` ON `customers`.`id` = `charges`.`customer_id` INNER JOIN `users` ON `users`.`id` = `charges`.`user_id` INNER JOIN `drivers` ON `drivers`.`id` = `charges`.`driver_id` WHERE (charges.written_on BETWEEN DATE('2020-10-18 04:27:10') AND DATE('2020-11-18 05:27:10')) GROUP BY customers.id, written_on ORDER BY customers.name, charges.written_on