app/controllers/customers_controller.rb

  def index
    @customers = Customer.search(params[:q]).
      filter_by(params).
      order('customers.name').
      paginate(:page => params[:page], :per_page => 20)
---
SELECT COUNT(*) FROM `customers`
SELECT `customers`.* FROM `customers` ORDER BY customers.name LIMIT 20 OFFSET 0

  def edit
    @customer = Customer.find(params[:id])
---
SELECT `customers`.* FROM `customers` WHERE `customers`.`id` = 17 LIMIT 1