app/controllers/drivers_controller.rb

SELECT COUNT(*) FROM `drivers`
SELECT `drivers`.* FROM `drivers` ORDER BY number LIMIT 20 OFFSET 0
---
  def index
    @drivers = Driver.order(:number).
      includes(:unit).
      paginate(:page => params[:page], :per_page => 20)