app/controllers/locations_controller.rb

SELECT COUNT(*) FROM `locations`
SELECT `locations`.* FROM `locations` ORDER BY name LIMIT 20 OFFSET 0
---
  def index
    @locations = Location.search(params[:q]).
      order(:name).
      paginate(:page => params[:page], :per_page => 20)