app/controllers/stats_controller.rb

SELECT COUNT(*) FROM `stats`
SELECT `stats`.* FROM `stats` ORDER BY date DESC LIMIT 20 OFFSET 0
---
  def index
    @stats = Stat.scoped

    unless current_user.admin?
      @stats = @stats.where('date >= ?', 1.month.ago.utc.to_date)
    end

    @stats = Stat.order('date DESC').
      paginate(:page => params[:page], :per_page => 20)