app/controllers/trips_controller.rb

  def index
    @trips = Trip.includes(:driver, :customer).
      order('trips.created_at DESC').
      paginate(:page => params[:page], :per_page => 20)
---
SELECT COUNT(*) FROM `trips`
SELECT `customers`.* FROM `customers` WHERE (`customers`.`id` IN (21,1,16))
SELECT `drivers`.* FROM `drivers` WHERE (`drivers`.`id` IN (1,7,6,2,8))
SELECT `trips`.* FROM `trips` ORDER BY trips.created_at DESC LIMIT 20 OFFSET 0