app/controllers/units_controller.rb

  def index
    @units = Unit.order(:number)
---
SELECT `units`.* FROM `units` ORDER BY number