app/controllers/users_controller.rb

SELECT `users`.* FROM `users` ORDER BY initials, initials
---
  def index
    @users = User.order(:initials)