app/controllers/vehicle_issues_controller.rb

SELECT `vehicle_issues`.* FROM `vehicle_issues` WHERE (completed_on IS NULL) ORDER BY vehicle_issues.created_at DESC LIMIT 20 OFFSET 0
---
  def index
    params[:completed] ||= '0'
    @vehicle_issues = VehicleIssue.search(params[:q]).
      filter_by(params).
      created_between(date_from, date_to).
      order('vehicle_issues.created_at DESC').
      paginate(:page => params[:page], :per_page => 20)